# AddSpaces Method

---
C#Visual BasicVisual C++
Revit 2024 API
---
Zone..::..AddSpaces Method
Zone Class See Also
---
Add a set of existing spaces to Zone element.
**Namespace:** Autodesk.Revit.DB.Mechanical**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public bool AddSpaces(
	SpaceSet spaces
)
```

Visual Basic
---
```text
Public Function AddSpaces ( _
	spaces As SpaceSet _
) As Boolean
```

Visual C++
---
```text
public:
bool AddSpaces(
	SpaceSet^ spaces
)
```

# ### Parameters
spaces
    Type: Autodesk.Revit.DB.Mechanical..::..SpaceSet The spaces which want to add to zone element.
# ### Return Value
If successful the current zone element will add a set of input spaces, otherwise nullNothingnullptra null reference (Nothing in Visual Basic).
# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentNullException | Thrown when the specified parameter Value is nullNothingnullptra null reference (Nothing in Visual Basic). |
| Autodesk.Revit.Exceptions..::..InvalidOperationException | Thrown when the input spaces cannot be added to current zone element. |

# See Also
Zone Class
Autodesk.Revit.DB.Mechanical Namespace